Repository: Serkan13-afk/Flutter_Projeleri
Catalog: Movie_App/lib/l10n/intl_*.arb
Languages: tr

# giris_yap
source: Login
tr: Giriş Yap

# kayit_yap
source: Register
tr: Kayıt Yap

# mail_adresi_gir_giris
source: Enter your email address
tr: Mail adresinizi giriniz

# sifre_gir_giris
source: Enter your password
tr: Şifrenizi giriniz

# sifrenimi_unuttun
source: Forgot your password?
tr: Şifreni mi unuttun ?

# adini_gir_kayit
source: Enter your name
tr: Adını gir

# soyadini_gir_kayit
source: Enter your surname
tr: Soyadını gir

# mail_adresi_gir_kayit
source: Enter a valid email address
tr: Geçerli bir mail adresi gir

# sifre_gir_kayit
source: Enter a valid password
tr: Geçerli bir şifre gir

# sifrenitekrar_gir_kayit
source: Re-enter your password
tr: Şifreni tekrar gir

# sife_unuttum_sayfasi
source: Forgot Password Page
tr: Şifre Unuttum Sayfası

# mail_adresi_gir_sifreunuttum
source: Enter your email address
tr: Mail adresini gir

# sifre_gir_sifreunuttum
source: Enter your new password
tr: Yeni şifreni gir

# sifre_degistir
source: Change Password
tr: Şifre Değiştir

# anasayfa
source: Home
tr: Ana Sayfa

# hosgeldiniz
source: Welcome
tr: Hoş Geldiniz

# premium_firsati
source: Premium Offer
tr: Premium Fırsatı

# premium_firsati_1
source: ✨ Upgrade to premium now, don’t miss the opportunities!
tr: ✨ Hemen premiuma gelin, fırsatları kaçırmayın!

# premium_firsati_2
source: ✨ Switch to Premium, Discover the Privileges Now! ✔️ Unlimited Movie & TV Show Streaming ✔️ Ad-Free Experience ✔️ 4K Ultra HD & 3D Sound ✔️ Watch Anywhere (Phone, Tablet, TV, PC) ✔️ Exclusive Premium Discounts 🔥 First Month Only: 19.90₺ 💳 Following Months: 59.90₺ / month 👉 Join Premium Now, Don’t Miss Out!
tr: ✨ Premium’a Geç, Ayrıcalıkları Hemen Keşfet! ✔️ Sınırsız Film & Dizi İzleme ✔️ Reklamsız Deneyim ✔️ 4K Ultra HD Görüntü & 3D Ses ✔️ Her Yerde İzleme (Telefon, Tablet, TV, PC) ✔️ Sadece Premium’a Özel İndirimler 🔥 İlk Ay Sadece: 19,90₺ 💳 Sonraki Aylarda: 59,90₺ / ay 👉 Şimdi Premium’a Katıl, Fırsatları Kaçırma!

# premium_satin_alma_sayfasi
source: Premium Purchase Page
tr: Premium Satın Alma sayfası

# premium_icerik
source: 🎬 Switch to Premium, Remove the Limits of Entertainment! Say goodbye to ads interrupting your movie and series fun, low quality visuals, and limited access. With Premium membership, open the doors of the entertainment world wide! 🌟 Premium Membership Privileges ✔️ Unlimited Movie & TV Show Streaming Watch thousands of movies, series, and documentaries as much as you want. Access new releases instantly! ✔️ Ad-Free, Uninterrupted Experience Say goodbye to ads appearing at the most exciting moments! Enjoy a completely seamless experience. ✔️ 4K Ultra HD + 3D Sound Watch your favorite scenes in cinema quality. With high resolution and powerful sound, feel like you are inside the movie. ✔️ Freedom to Watch Anywhere With a single membership, easily log in from your phone, tablet, computer, or smart TV. Wherever you are, entertainment is with you. ✔️ Exclusive Premium Discounts Special campaigns, content, and advantages only for Premium users are waiting for you. 💸 Pricing 🔥 First Month: Only 19.90₺ 💳 Following Months: 59.90₺ / month 👉 Step into the Premium world at a low cost, enjoy unlimited entertainment to the fullest! 🎁 Why Switch to Premium? A better quality, faster, and freer viewing experience. The chance to watch your favorite movies anytime, anywhere. A library full of ad-free, uninterrupted, and completely personalized content. Bring the cinema experience to your home at affordable prices. 🚀 Join Premium Now! Don’t limit your entertainment, feel the difference. Switch to Premium now and don’t miss the first month only 19.90₺ offer! 👉 [Switch to Premium]
tr: 🎬 Premium’a Geç, Eğlencenin Sınırlarını Kaldır! Film ve dizi keyfini yarıda bırakan reklamlar, düşük kalite görüntü ve sınırlı erişim artık geçmişte kaldı. Premium üyelik ile eğlence dünyasının kapılarını sonuna kadar arala! 🌟 Premium Üyeliğin Ayrıcalıkları ✔️ Sınırsız Film & Dizi İzleme Binlerce film, dizi ve belgeseli istediğin kadar izle. Yeni çıkan yapımlara anında erişim sağla! ✔️ Reklamsız, Kesintisiz Deneyim Keyfin en heyecanlı yerinde çıkan reklamlara elveda de! Tamamen kesintisiz bir deneyim yaşa. ✔️ 4K Ultra HD + 3D Ses En sevdiğin sahneleri sinema kalitesinde izle. Yüksek çözünürlük ve güçlü ses teknolojisiyle kendini filmin içinde hisset. ✔️ Her Yerde İzleme Özgürlüğü Tek üyelikle telefon, tablet, bilgisayar ve akıllı TV’den kolayca giriş yap. Nerede olursan ol, eğlence seninle. ✔️ Premium’a Özel İndirimler Sadece Premium kullanıcılarına özel kampanyalar, içerikler ve avantajlar seni bekliyor. 💸 Fiyatlandırma 🔥 İlk Ay: Sadece 19,90₺ 💳 Sonraki Aylarda: 59,90₺ / ay 👉 Düşük maliyetle Premium dünyasına adım at, sınırsız eğlenceyi doyasıya yaşa! 🎁 Neden Premium’a Geçmelisin? Daha kaliteli, daha hızlı, daha özgür izleme deneyimi. Sevdiğin filmleri istediğin yerde, istediğin zaman izleme şansı. Reklamsız, kesintisiz ve tamamen sana özel içeriklerle dolu bir kütüphane. Sinema keyfini evine getirirken cebini zorlamayan fiyat. 🚀 Hemen Premium’a Katıl! Eğlenceyi sınırlama, farkı yaşa. Şimdi Premium’a geç, ilk ay sadece 19,90₺ avantajını kaçırma! 👉 [Premium’a Geç]

# encok_izlenen
source: Most Watched
tr: En Çok İzlenenler

# aksiyon
source: 🎬 Action
tr: 🎬 Aksiyon

# macera
source: 🗺️ Adventure
tr: 🗺️ Macera

# animasyon
source: 🐭 Animation
tr: 🐭 Animasyon

# komedi
source: 😂 Comedy
tr: 😂 Komedi

# suc
source: 🔫 Crime
tr: 🔫 Suç

# aile
source: 👨‍👩‍👧‍👦 Family
tr: 👨‍👩‍👧‍👦 Aile

# fantastik
source: 🧙‍♂️ Fantasy
tr: 🧙‍♂️ Fantastik

# tarih
source: 🏰 History
tr: 🏰 Tarih

# korku
source: 👻 Horror
tr: 👻 Korku

# muzik
source: 🎵 Music
tr: 🎵 Müzik

# gizem
source: 🕵️ Mystery
tr: 🕵️ Gizem

# romantik
source: ❤️ Romance
tr: ❤️ Romantik

# bilim_kurgu
source: 👽 Sci-Fi
tr: 👽 Bilim Kurgu

# gerilim
source: ⚡ Thriller
tr: ⚡ Gerilim

# kovboy
source: 🤠 Western
tr: 🤠 Kovboy

# yayinlanmasi_beklenen
source: Coming Soon
tr: Yayınlanması Beklenen

# korku_seansi4
source: The Conjuring 4
tr: Korku Seansı 4

# korku_seansi4_icerik
source: This upcoming supernatural horror movie follows paranormal investigators Ed and Lorraine Warren. They face their final and most terrifying case when confronting the demonic forces that cruelly haunt a family in Pennsylvania. The film is inspired by the real-life Smurl haunting case.
tr: Bu yakında çıkacak doğaüstü korku filmi, paranormal araştırmacılar Ed ve Lorraine Warren'ı konu alıyor. Onlar, Pennsylvania’da bir aileyi acımasızca rahatsız eden şeytani güçlerle yüzleştikleri, hayatlarının son ve en korkunç davasıyla karşı karşıya kalıyorlar. Film, gerçek hayattaki Smurl musallat olayından esinlenmiştir.

# film_bulunamadi
source: Movie not found
tr: Film bulunamadı

# film_adi_yok
source: No movie title
tr: Film adı yok

# kayitli_filmler
source: Saved Movies
tr: Kayıtlı Filmler

# kayitlilar
source: Saved
tr: Kayıtlılar

# film_arama
source: Movie Search
tr: Film Arama

# yeni
source: New
tr: Yeni

# arama
source: Search
tr: Arama

# ek_islemler
source: Additional Actions
tr: Ek İşlemler

# karekod
source: QR Code
tr: Kare Kod

# uygulama_karekodu
source: App QR Code
tr: Uygulama Karekodu

# geribildirim
source: Feedback
tr: Geri Bildirim

# bilgilendirme
source: Information
tr: Bilgilendirme

# bilgilendirme_yazisi
source: Information Text
tr: Bilgilendirme Yazısı

# bilgilendirme_yazisi_icerik
source: Step into the magical world of cinema! ✨ With the Movie app, discover your favorite movies, watch trailers, and easily access detailed information. 🎥 Thanks to the wide movie archive categorized by genres, finding the right content for your taste is super easy. 🍿 Add to favorites, be the first to know about new releases, and share with your friends. 🌟 With its modern design and user-friendly interface, carry the joy of movies with you at all times. 📱 Movie is an indispensable guide for cinema lovers! 🚀
tr: Sinemanın büyülü dünyasına adım at! ✨ Movie uygulamasıyla en sevdiğin filmleri keşfet, fragmanlarını izle ve detaylı bilgilere kolayca ulaş. 🎥 Kategorilere ayrılmış geniş film arşivi sayesinde tarzına uygun yapımları bulmak çok kolay. 🍿 Favorilerine ekle, yeni çıkanları ilk sen öğren ve arkadaşlarınla paylaş. 🌟 Modern tasarımı ve kullanıcı dostu arayüzü ile film keyfini her an yanında taşı. 📱 Movie, sinema tutkunları için vazgeçilmez bir rehber! 🚀

# anladim
source: Got it
tr: Anladım

# cikis
source: Logout
tr: Çıkış

# cikis_ekrani
source: Logout Screen
tr: Çıkış Ekranı

# cikis_ekrani_icerik
source: Are you sure you want to log out?
tr: Çıkış yapmak istediğinizden emin misiniz

# iptal
source: Cancel
tr: İptal

# onayla
source: Confirm
tr: Onayla

# film_puan_ortalamasi
source: Average movie rating
tr: Film puan ortalaması

# puanlama_yapan_kisi_sayisi
source: Number of users rated
tr: Puanlama yapan kişi sayısı

# yayinlanis_tarihi
source: Release date
tr: Yayınlanış tarihi

# populerligi
source: Popularity
tr: Popülerliği

# web_sayfasina_bakin
source: See details on the website -->
tr: Web sayfasinda detaylara bakın -->

# reklam_bulunamadi
source: Ad not found
tr: Reklam bulunamadı

# sistem_dili_degisti
source: System language has been changed to Turkish
tr: Sistem dili Türkçe olarak değiştirildi

# film_basarili_bir_sekilde_kayitlara_eklendi
source: Movie successfully added to saved!
tr: Film başarılı bir şekilde kayıtlılara eklendi !

# film_basarili_bir_sekilde_kayitlardan_cikarildi
source: Movie successfully removed from saved!
tr: Film başarılı bir şekilde kayıtlılardan çıkarıldı !

# kayit_basarili_bir_sekilde_yapildi
source: Registration completed successfully!
tr: Kayıt başarılı bir şekilde yapıldı !

# sifre_guncellendi
source: Password updated!
tr: Şifre güncellendi !

# detaysayfasi_snackbar_mesaj1
source: Movie successfully added to saved!
tr: Film başarılı bir şekilde kayıtlılara eklendi !

# detaysayfasi_snackbar_mesaj2
source: Movie successfully removed from saved!
tr: Film başarılı bir şekilde kayıtlılardan çıkarıldı !

# maingiris_snackbar_vericekilemedi
source: Failed to fetch data from the system!
tr: Sistemden veriler çekilemedi !

# maingiris_snackbar_bosalanvar
source: Empty fields exist, please try again!
tr: Boş alanlar mevcut tekrar dene !

# maingiris_snackbar_mailveyasifreyanlis
source: Email or password is incorrect!
tr: Mail veya şifre yanlış !

# mainkayit_snackbar_bosalanlarvar
source: Empty fields exist, please try again!
tr: Boş alanlar mevcut tekrar dene !

# mainkayit_snackbar_sifreuyusmuyor
source: Passwords do not match!
tr: Şifreler uyuşmuyor !

# mainkayit_snackbar_kayitbasarili
source: Registration completed successfully!
tr: Kayıt işlemi başarılı bir şekilde gerçekleşti !

# mainkayit_snackbar_gecerlimailgir
source: Please enter a valid email address!
tr: Geçerli bir mail adresi giriniz !

# mainsifremiunuttum_snackbar_bosalanvar
source: Empty fields exist!
tr: Boş alanlar mevcut !

# mainsifremiunuttum_snackbar_verilercekilemedi
source: Failed to fetch data from the system!
tr: Sistemden veriler çekilemedi !

# mainsifremiunuttum_snackbar_sifreguncellendi
source: Password updated!
tr: Şifre güncellendi !

# anasayfapremium_snackbar_premiumaldin
source: Congratulations, you have purchased Premium
tr: Tebrikler premium satın aldınız

# mailkonu
source: Subject
tr: Konu

# maildusunce
source: You can write your thoughts here
tr: Düşüncelerinizi buraya yazabilirsiniz
